[
    {
        "text": "Recruiters and talent leaders often think that employee engagement is HR’s problem. They couldn’t be more wrong about that. Believe it or not, when employees are disengaged, recruiting suffers. But when your company makes engagement a priority, you’ll avoid negative online reviews, turn existing employees into brand ambassadors, generate hiring referrals, and bolster your employer brand — all of which will make your life as a recruiter easier. But while your HR teammates may be up to speed on the latest trends in employee engagement, you’ve probably been busy building a talent pipeline. Here’s what you need to know about the state of employee engagement today — and why it’s not just HR’s problem. If you want to understand employee engagement, you have to understand how it became such an integral part of the conversation about work and business. Professor William Kahn is still talking about employee engagement 25 years after he coined the term in an academic paper while teaching at Boston University. In that paper, “ Psychological Conditions of Personal Engagement and Disengagement at Work ,” Kahn explained terms like “personally engaged” (workers expressing and employing their personal selves) and “disengaged” (workers withdrawing and defending their personal selves). Kahn recently talked to Workforce Magazine about how he became interested in employee engagement and where he believes the concept is headed. When asked how he originally identified the issue of employee disengagement, he said: People were often doing only what needed to be done, as defined and directed by others, and their work had very little of their own personal selves, very little of what they thought and felt ought to happen as they went about their work. Managers did not really understand the problems, which they thought had to do with employees not being the right fit for the job or not being rewarded enough for their work. In the years to come, Kahn would spend a lot of time observing and writing about employee engagement. But he isn’t the only one invested in the topic. If your organization has made engagement a priority — and it should — it only makes sense to know how we got here and where the concept is headed. Click To Tweet Before we get into the here and now, let’s discuss a bit more history. At the outset of his research into engagement, Kahn wanted to know why some employees became “attached” to their work and what caused them to bring their “preferred selves” to their work. These employees were displaying their full talents and efforts at work, rather than defending themselves from their work. There’s a balance to be struck, Kahn believed, between giving people control over what they do and how they do it and management’s desire to control employees’ performance and productivity. It may seem obvious now, but at the time, the idea was revolutionary. So what was Kahn’s prescription for improving employee engagement? Letting employees freely express how they feel and what they think about their work experiences. Twenty-five years later, we’re still trying to find the best ways to accomplish that. Meanwhile, other visionaries have weighed in and influenced the conversation around employee engagement. The way we think about employee engagement today has a lot to do with the Society for Human Resource Management (SHRM), the first professional society to consider it a best practice. In 2006, Robert J. Vance, Ph.D., an industrial psychologist and human resource management professional, created SHRM’s “ Employee Engagement and Commitment, a guide to understanding, measuring, and increasing engagement in your organization “. The economic pressures of the last 25 years, Vance explained, have caused many companies to restructure and reduce their workforces, breaking the traditional psychological employment relationship and reducing expectations of employer reciprocity. Employees no longer have the expectation of working for the same employer until retirement, leaving them feeling less loyal to and less invested in their employers. Vance describes conditions of engagement, like employees being satisfied with their work, being proud of their employers, enjoying and believing in what they do at work, and feeling their employers value their talents, efforts, and achievements. When these needs are met, employees are far more likely to be happy about giving extra effort on the job and more likely to stay with their employers. This may sound like touchy-feely stuff, but it’s anything but. In 2002, James Harter, Frank Schmidt, and Theodor Hayes studied the effects of employee satisfaction on business outcomes for productivity, employee turnover, customer satisfaction, and profit. They demonstrated the link between employee engagement and profit, which led to the intense interest in engagement we’ve been reading about, watching, and measuring for years. With such a heavy influence on companies’ bottom lines, it’s no surprise that engagement has become a hot topic for major organizations. Leaders from a variety of organizations — including NASA, Gallup, and the National Institute for Health Research — have made employee engagement a priority. Human resource experts like Ceridian’s VP of market strategy Jayson Saba know that 2016 will bring some significant advances in employee engagement. He predicts that there will be more focus on team engagement, traditional performance management (read: annual performance reviews) will change to performance development, and there will be more engagement efforts for hourly employees. Meanwhile, the Human Capital Institute’s 2016 Employee Engagement Conference in Denver, Colorado will address how business leaders can create employee engagement, harness employee satisfaction, and drive retention with recognition and training. The conversation will include engagement-centered topics like using video to keep a geographically dispersed workforce motivated and happy, simplifying incentives, and measuring real-time engagement. Engagement isn’t just an HR problem. More than ever, it’s a recruiting problem. But the way we tackle engagement today is different than when Kahn first called it as he saw it. It refocuses management and employees away from the negatives of employees’ work towards a more positive understanding of what motivates employees to do their best. If it’s not a priority for your organization, you’re going to lose your top performers — and you’re going to lose them soon.", 
        "message": "Employee engagement turns 25 this year. What does that mean for you?", 
        "link": "http://bit.ly/20TMgU7", 
        "title": "Employee Engagement Turns 25: What That Means for Recruiters"
    }, 
    {
        "text": "One day, while Tim Dierkes was working a temp gig after college, a lightbulb went off. He realized that recruiting — unlike the temp work he was doing — intrigued him. “The idea of helping people find a job or career fascinated me,” he said. On his way to becoming the lead internal recruiter at Gainsight , Dierkes hired everyone from temporary warehouse workers to senior executives. He especially enjoys working as an internal recruiter not only because he gets to hire candidates for the company he works for, but also because he gets to see those candidates’ careers flourish. His work at Gainsight offers him a unique outlook on recruitment, its best practices, and how to create scaleable hiring processes. Tim was kind enough to let us pick his brain about the state of recruiting today, how he works with hiring managers, and what’s keeping him up at night these days. What were the biggest recruiting lessons you learned in 2015? While I’ve worked at a startup before, this was my first role as a recruiter dealing with the quick growth of a startup. No matter how prepared I thought I was, there were always a few surprises waiting for me right around the corner. Some might find that frustrating, but I think that’s the exciting part of working at a company like Gainsight. There are always new challenges, and I get to write the book here on how to solve them. This past year, I focused on building great relationships within the HR department. By doing so, the director of employee success and I have been able to help each other stay ahead of the hiring curve. What do you enjoy most about being a recruiter? I love talking with people about their careers and connecting them to jobs they love. No matter what you do for a living, you need to find value in what you do outside of your paycheck. We spend so much time at work – often more than with our families – that doing something you enjoy and are passionate about is paramount. As a recruiter, I get to be the conduit that connects candidates with new career opportunities and often their dream jobs. Now, what do you enjoy least about recruiting? The pain points in recruiting are pretty universal, and I’m no different. Mine include: Speaking of satisfying your hiring managers, what are your best practices for collaborating with those stakeholders during the hiring process? Hiring managers are just like customers. They have their own expectations, and you either need to deliver on those expectations or educate them on why [doing so] might be difficult. Part of that challenge is when hiring managers want a candidate who doesn’t exist, AKA the elusive “purple squirrel.” I always want to help people, so I don’t enjoy telling them “no,” or “that person doesn’t exist.” The best tip I can share isn’t a secret. Maintain communication. Treat them with the same respect you would a customer. Share the challenges you’re facing in finding their perfect — or near-perfect — candidate, and bring their ideas to the table on how to address those challenges. What recruiting obstacles are you facing at the moment? Scaling, scaling, and scaling. Did I mention scaling? My major focus right now is building processes that will allow the recruiting function to be more agile, whether that’s building a more efficient — yet still effective — interview process, improving metrics tracking for informative reports, or defining best practices for communicating with hiring managers and candidates. Using recruiting software like Gild’s platform will be instrumental when it comes to scaling our processes. It will help us maintain consistency, so we plan to train all new recruiters on this technology immediately, before any bad habits are developed. Can you tell me about the obstacles that recruiting as a profession is facing today? Hold on, let me go check the 15 InMails I got from recruiters today, and I’ll get back to you. Seriously though, cutting through the fog and getting your message to candidates who are open to it is the biggest challenge. This problem is only going to get more challenging. While the tightening labor market is great for the economy, it does makes recruiters’ jobs more difficult. Finding an effective way to communicate with potential candidates will continue to be a challenge as the economy grows. We must get ahead of this issue by discovering and creating ways to work smarter, not harder, and to connect the right people with the right opportunities at the right time. Hiring success management software can be a huge help in that area. What traits does a recruiter need in order to be successful? Attitude is everything. If you don’t have the energy and passion for this, you’ll burn out quickly. Like most jobs, recruiting never ends. If you need a job where you can “clear your desk” at the end of each day, recruiting isn’t for you. A close second to the right attitude is organization. Everyone has their own methods, but as long as you can get the information you need when you need it, you’ll be able to find candidates when others might have a hard time. OK, last question. What are your personal best practices for hiring success? Timely feedback is important. I always tell candidates when they can expect to hear from me and make sure they feel comfortable reaching out to me after their interview. When they do follow up with me, it ensures that I maintain communication with them while also proving to me they’re responsible and genuinely interested in the position. When it comes to working with hiring managers, I make it a point to know how often they’d like updates. I’ve made it a habit to find out early on if they prefer daily updates, real-time emails or just a weekly huddle. Gild’s notifications are a huge help when it comes to keeping hiring managers informed. Finally, being organized is one of the most important things you can do as a recruiter. Using a reliable and efficient applicant tracking system is essential in helping me be productive, especially when it comes to tracking candidates, sorting them, and retrieving information on command — even finding a candidate I spoke with about a job four months ago that wasn’t open at the time but that I now desperately need to fill.", 
        "message": "Q&A with Tim Dierkes from @GainsightHQ: Find out how he's building a recruiting process from the ground up", 
        "link": "http://bit.ly/1or2poi", 
        "title": "8 Questions with Gainsight Recruiter Tim Dierkes"
    }, 
    {
        "text": "Happy Leap Day! I’m honored that you’re taking five minutes out of your once-every-four-years festivities to catch up on this week’s best talent acquisition headlines. You won’t be sorry. I’ve Got Data Showing Whether Higher-Paid Recruiters Are Worth More Or Not You probably spend a lot of your time thinking about how much particular candidates are worth. But how much are you worth? And could you or should you ask for more? A VP from a top national staffing company has data to back up his answers. Via EREmedia.com eSports — An Under-The-Radar Social Media Community That Recruiters Should Use Have you heard of this thing? I hadn’t — until now. If you’re looking for killer tech candidates, don’t miss the boat on this talent-rich recruiting source. Let Dr. John Sullivan sell you on it, then see if it’s right for your own hiring efforts. Via EREmedia.com How This Founder Grew His Company From 10 to 400 Employees in a Single Year Beyond learning how Thrive Market’s founder completed this feat, you’ll get to delve into how he did it well . Hint: it involves culture. Via Inc.com Do You Know What Your Candidates Are Thinking? (And I don’t mean Bernie and Donald!) Get a peak into what candidates actually want from their job search experience. Then use this information to audit and improve your own processes, just in time for spring cleaning. Via ChinaGorman.com 5 Perks And Benefits You Might Not Have Thought To Negotiate There’s more to negotiating a job offer than just salary. If you don’t have the budget to buy talent away from your competitors, get creative. Bonus: This one is written for job seekers, so you’ll get a serving of candidates’ mindset, in addition to potentially attractive perks. Via FastCompany.com Talent Acquisition: The New Frontier We’ve said it before: recruiters need to start thinking more like marketers, especially as employer branding becomes increasingly intertwined with straightforward corporate branding. If you’re still trying to understand why, how, and when, this article is a great resource. (You’ve got to sign up for HCI to read this one, but it’s free, it’s fast, and we think it’s totally worth it.) Via HCI.org", 
        "message": "Companies Pay Their #Recruiters More", 
        "link": "http://bit.ly/1Qo47AX", 
        "title": "GILD 5-MINUTE MONDAY: What Happens When Companies Raise Recruiters’ Salaries?"
    }, 
    {
        "text": "Do you still think of job applicants as commodities? If so, think again. With unemployment rates hitting their lowest levels in eight years and social media playing an ever larger role in the job search process, the way candidates search for jobs has changed dramatically. Gone are the days when even the most qualified professionals spent hours perusing the want ads or endlessly scrolling job boards. Today’s top candidates read employer reviews on sites like Glassdoor.com and apply for open positions with their phones whenever it’s convenient for them. Don’t believe us? The 2015 Jobvite Job Seeker Nation Study reveals that the job search happens anytime, anywhere. It happens on smartphones, at work, and during the commute. Increasingly, the job search takes place all over social media. From Twitter to Facebook to LinkedIn, people are sharing job opportunities with friends and colleagues, as well as their perspectives on employers — even their takes on the recruiting process. As a result, smart employers are doubling down on improving the job application experience. Research shows that a priority on candidate experience lowers employers’ cost-per-hire rate. Plus, since many potential job candidates are also potential customers, treating a candidate poorly or not communicating effectively during their job application process means you’re not only losing potential talent — you might also be losing a loyal customer. After all, who better to sell, build, or market your products and services than a customer who already loves what you do? Applicant experience has become so important that the Talent Board North American Candidate Experience Awards recognizes companies that place value on a positive candidate experience, “by which job candidates are met with a simple, transparent process when applying and interviewing for jobs and kept informed of their status along the way.” The awards included nearly 130,000 candidates who responded to 200 participating companies from a wide range of industry sectors and sizes. If you’re not placing a premium on candidate experience, it’s time to take a few notes from the companies that received the highest positive ratings. Founded in 1939, Blue Cross Blue Shield of Michigan manages individual and employer health benefit plans for almost six million people, making it the largest health insurer in the state. It also happens to have 8,000 employees. But being an enormous organization doesn’t stop Blue Cross from making candidate experience a top priority. The company provides candidates with real time status updates on applications and uses candidate surveys throughout the application process. Every candidate gets feedback — not just the candidates who get interviewed and hired. How does Blue Cross pull this off? Stefanie Thornton, the company’s talent acquisition director, explains that a Candidate Communication Agent tool is used, which enables candidates to see a real-time status update on their applications. Additionally, candidates can log in to their profiles within the company’s applicant tracking system and get updates and links to company news. BCBS also uses candidate surveys throughout the application process and uses that information to continuously improve their candidate experience. Most companies use social to broadcast their job descriptions, but few use it to actually engage with candidates. The Comcast Corporation’s Candidate Care teams provide real-time recruiting transparency through social media by answering candidate questions in Twitter chats, giving career advice, and posting relevant company information. This focus on social engagement helps personalize the global cable giant and enhances its employer brand. In addition to a focus on social, the Candidate Care team aims to deliver the “white glove treatment” to all applicants, and Comcast has even enhanced its career website with features like mobile apply, enhanced search, and job preview videos. Questrade is a discount brokerage that provides trading tools, competitive commissions, and options. The company knows that candidate experience is the foundation of employee engagement. It also recognizes that many candidates are also clients, meaning that it’s doubly critical that Questrade create and maintain the best candidate experience possible. Kristina Tierney, Questrade’s chief people officer, says that the company works to provide a “consistently positive experience” for all candidates. In a 2015 press release , Tierney said: “Our motto is ‘work doesn’t need to suck’ and we believe that’s also true when looking for a job. ” She added: “Every person deserves the same respect and highly responsive service from Questrade, regardless of the nature or purpose of their contact with us.” The company lives up to commitment by encouraging employees to tell their stories with testimonials published in an employee-run blog. It also engages candidates in social media and emphasizes how Questrade helps employees with career growth and continuous learning. In today’s cutthroat talent market, creating an exceptional candidate experience is a competitive advantage. It’s deeply connected with employee engagement and your employer brand, and it can even have a powerful impact on your customer base. With so much riding on a great candidate experience, you can’t afford not to make it a priority.", 
        "message": "Hear how the best hirers in the business are winning the war for talent.", 
        "link": "http://bit.ly/1oayznZ", 
        "title": "How 3 Companies Created Amazing Candidate Experiences"
    }, 
    {
        "text": "Originally appeared on Recruiting Daily 02/18/16. Twenty years ago, if you wanted to find a specific person — whether it was the perfect romantic counterpart or an ideally suited future employee — you could expect to spend months searching for anyone who simply qualified. The advent of the internet changed that completely. Suddenly, a tsunami of potential new candidates opened up for both personal and professional searches, and both lovers and recruiters had more options than they’d ever dreamed existed. The introduction of the web meant that people from anywhere in the world could connect with millions of new people from anywhere else, and conversations or relationships that would have been unfathomable before were suddenly possible. Dating sites started to spring up left and right to help connect potential matches, and traditional recruiting practices were entirely upended (think: physical job boards going digital). But this rush of new options created an entirely new–but equally problematic–challenge: too much information. In hiring, and also in love, there can be too much of a good thing. The average job listing elicits 250 applicants, while Tinder, for example, generates 1.4 billion swipes (potential matches) per day. With volume that high, quality control becomes nearly impossible, and people end up discarding candidates (either romantic or professional) without any real review, or else giving up entirely. For dating, you’re left sorting through a lot of… less-than-desirable options. For hiring it means that dozens of qualified, potentially incredible workers get overlooked while recruiters are forced to waste hours digging through irrelevant resumes or following false leads. Most recruiters end up either relying on referrals or just seizing upon the first people who somewhat conform to the job description, even if they aren’t truly the best fit. The system is incredibly inefficient, and the cost to an organization is substantial. So how do you contend with this overwhelming influx of potential new matches? That’s where OKCupid’s technical breakthroughs set the stage for a new way of managing massive amounts of information. There were other popular dating sites at the time of its rise to popularity, but OKCupid was the one that developed a reputation for its innovative use of data science and groundbreaking algorithm. The company also ran a notorious (now defunct) data blog in which it used its datasets to analyze romantic trends. Using user-sourced data and a single simple formula, OKCupid was able to pair each user with his or her most compatible dating prospects. Data science enabled it to turn that data into incredibly valuable (and interesting!) insights about the landscape of modern love–which is, after all, its operational industry. It was the one of the first and most public uses of smart new technologies and information as a way of helping people find people. Just like dating, hiring is an incredibly specific process, with several similar steps. Hiring managers need to find candidates that are not only “appealing” (experienced, highly qualified, etc.), but also a fit for that particular company. Do the candidate’s strengths round out the team’s weaknesses? Could he or she promote the values of the company? Does the hire promote a higher diversity of experience? All valid considerations, but difficult to balance in an extremely competitive hiring market with a flood of prospects. Recruiters need to operate quickly and with precision. They need to be confident in their candidate choices and equipt with the information to engage with them and draw them in as quickly as possible. Automation, like the kind used by OKCupid, helps them do that. There’s enough publicly available information about any potential candidate on the internet to make strategic sourcing exceptionally easy. If software can combine data from social networks, blogs, work portfolios, and other sources, it can generate a pretty thorough picture of a person in nanoseconds. Then, it can present recruiters with their “top matches” before they even start the sourcing process. That type of automation has played a key role in defining the modern hiring market. Sourcing, engaging, onboarding, growth… Everything has gotten much, much, much faster as a result. Hiring competition has reached an all-time high, and it’s largely because organizations can operate that much more efficiently. The second component of OKCupid’s major contributions — analytics and data science — has proven equally critical. That’s because speed on its own isn’t enough. In a world where the average cost of a misplaced hire is 2.5 times that employee’s annual salary, regular mistakes aren’t sustainable. Recruiters have to completely understand the industry landscape, the candidates, the needs of their own organization, and how each candidate would fit in. The right strategically-designed analytics solution can help them do that. We’re living in a brave new world with more connections, more interactions and more potential relationships. It can feel overwhelming at times, but ideally what it ultimately means is that we’re all that much closer to finding our perfect match — whether that means meeting a partner or finally landing that one hire who takes your whole business to the next level.", 
        "message": "How OKCupid Changed Hiring Forever ft. @robcarroll ", 
        "link": "http://bit.ly/1oQyOEP", 
        "title": "How OKCupid Changed Hiring Forever"
    }, 
    {
        "text": "There’s no doubt about it: Millennials are a powerful generation. Millennials make up the largest demographic in today’s workforce, with an estimated 75 million of them at work today. It’s also expected that these digitally savvy young professionals will make up 75 percent of the global workforce by 2025 . That means that hiring Millennials effectively is crucial to the future of your company. Unfortunately for recruiters, Millennials are notoriously hard to hire — especially for recruiters who are still hiring the old-fashioned way. To land the best of today’s young talent, you’ll have to rethink your approach and re-evaluate your tech stack. Millennials are tech savvy, well educated, entrepreneurial, and socially aware. This means if recruiters want to attract top performing Millennials, they need to also connect on all of the things that today’s young professionals care most about. First and foremost, Millennials — like their counterparts from other generations — care most about the role itself. It’s critical that recruiters provide job descriptions that convey not only the tasks and responsibilities of each role, but also how each role impacts the company’s overall mission. Job reqs can supply that information at a high level, but recruiters and hiring managers should be prepared to discuss how each position can contribute to the whole company’s success. Opportunities for learning new skills and professional development are equally important, especially for younger Millennials who may be new to the workforce. But while your outreach should focus primarily on the role itself, remember that how you communicate will also carry some influence with many Millennials. While developing the talent-matching application ThisWay at the University of Cambridge, Angela Hood spent a lot of time with young people. She noted that Millennials live much of their lives on social platforms, which means organizations that want to identify and attract them should also be on social. At the same time, Millennials are protective of their privacy online, Hood said, “so companies need to be careful about interacting with them on social platforms.” Hood added that companies should be wary of connecting with Millennials on social networks that may be considered personal, like Facebook. On the other hand, networks like Twitter and Reddit are considered more public and acceptable for recruiting outreach. Most Millennials grew up in a 24/7, always-on society where pretty much anything they want was available with a push of a button. Consequently, they’re used to getting immediate feedback. While their colleagues may think nothing of applying for a position and waiting weeks or months for a response, Millennials expect updates throughout the process. This kind of feedback can even come in the form of a periodic check-in by text from a hiring manager, which Hood said Millennials do appreciate. In short, companies really need to up the technology ante to be able to efficiently manage such a constant stream of communication. But while Hood stressed that speed and technology are key to attracting Millennial talent, but not just any technology will do. Companies often think if they have a digital presence and accept applications electronically, they’re all set. When it comes to Millennials, companies have to do more, including the use of systems that leverage data science, machine learning, and predictive analytics. Emerging solutions like Hiring Success Management (HSM) platforms can help your team uncover passive Millennial talent, refine your job descriptions to address the current talent market, and communicate quickly and effectively with your talent pool. Additionally, sourcing up-and-coming talent with emerging tech can come with an unexpected benefit: using advanced SaaS platforms in your recruiting outreach can reinforce your organization’s commitment to using innovative solutions to solve age-old problems. That’s an organizational trait that will appeal to almost everyone, not just Millennials. It would be wrong to paint any group of people — let alone a whole generation — with too broad a brush, but it’s more than fair to say that Millennials expect potential employers to connect with them in ways that previous generations did not. To land the best of today’s young professionals, recruiters need to rethink how they source, communicate with, and market to top talent.", 
        "message": "Can emerging tech and smarter #sourcing solve your business's #Millennial problem?", 
        "link": "http://bit.ly/1ToxFQj", 
        "title": "Is Smarter Recruiting Technology the Key to Hiring Top Millennial Talent?"
    }, 
    {
        "text": "Your CEO is trying to grow her business. You’re trying to grow the team that enables her to do that. So why does she seem so clueless about how important talent acquisition is? We’ve touched on the C-suite/Talent divide before , but that’s just the tip of the iceberg. There are still some fundamental changes that need to happen before most CEOs truly get the ways that talent is changing. It’s also up to talent leaders to take the initiative and sell those changes internally. Here are three key messages your C-suite needs to get through their heads in order to help you grow the business effectively. There was a time when recruiting was just another aspect of HR. Recruiters were lumped in with compliance officers, benefits and payroll administrators, and the other usual suspects. And being a part of HR traditionally meant that talent leaders reported to cost-conscious Chief Financial Officers. But that’s entirely the wrong place for today’s recruiting leaders. Unlike the rest of the HR squad, talent teams are charged with beating the competition. And if people are a company’s largest investment , then talent leaders need to be laser-focused on bringing in the best of the best, not worrying about pinching pennies. In an ideal world, talent leaders should report directly to the CEO or COO and work closely with them to support strategic objectives through smart hiring plans. To help your C-suite see the light — and to get you out from under the HR umbrella — you’ll need to prove that your team isn’t just another cost center. Make the case for an organizational change by demonstrating your team’s impact on company revenue through hard data . However, data’s just one part of the organizational change equation. Before your CEO will buy the need for change, you’ll have to convince them that you’re capable of being a partner in strategic decision-making. Unfortunately, your C-suite probably isn’t aware that you possess that capability. They think your job is simply to make sure your team fill roles when they’re asked to fill roles. On top of that, they probably haven’t asked you to understand the overall business’s strategy, and they almost certainly didn’t offer you a seat at the table when that strategy was being developed. It’s up to you to prove them wrong and earn that seat at the table. Learn what your executives’ priorities are . Show that you understand how your role as a talent leader can support those priorities effectively. Make it clear that you need to be involved in strategic planning sessions. And don’t be afraid to be vocal about why talent needs to be kept in the loop when business strategy changes. And while you’re at it… You’re not going to beat the other guys to the best talent with outdated tools. And if you’re still working with 90s tech (like a stand-alone ATS ), you’re definitely not growing your organization as effectively as possible. After all, there’s a reason why HR and recruiting tech is a $15 billion market . Smart companies are realizing that old tech is costing them top talent, and they’re racing to find better, more sophisticated solutions. But before you pitch the powers that be on the idea of procuring yet another software platform, do your homework. Be prepared to show how smarter tech can deliver dollars and cents. A solution that can speed up the hiring process, improve the quality of your hires, deliver information on new markets and employment trends, and reduce the sheer amount of tools your team uses should be an easy sell — but only if you make it about ROI. Your C-suite isn’t likely to spend money just to make your life easier (if only), but they will open the checkbook if you can show the correlation between improved hiring and overall company performance. If your C-suite doesn’t understand that talent acquisition has changed — and that your role has to change with it — then it’s up to you to educate them. Speak up, and make it abundantly clear that recruiting-as-usual is damaging every part of your business. Show that you understand the business’s needs and that, with the right tools and organizational support, your team is prepared to address them. Your CEO will be glad you did. If they’re not, it’s probably time to think about getting yourself recruited by someone else.", 
        "message": "Your CEO is clueless about #talentacquisition — and that's on you. Here's how to show them the light", 
        "link": "http://bit.ly/1odEAjk", 
        "title": "YOUR CEO IS CLUELESS ABOUT TALENT ACQUISITION. HERE’S HOW TO FIX THAT."
    }, 
    {
        "text": "Welcome to our weekly party! You know, the one where we serve up the most intriguing talent management headlines of the past week just in time for your Monday coffee. So glad you could make it. Don’t be a stranger! Does Your CEO Have a Higher Purpose? What issues do CEOs care about and which actions are top of their lists? This article has the answers. Oh, and guess what? If you’re a talent leader, several of those answers involve you. Learn what those priorities are, and get a plan in place to address them. Via ChinaGorman.com. A ‘bold new world’ for HR in 2016? Wouldn’t you love to know how your peers plan to upgrade and use their HR technologies this year? Your wish is Bersin’s command. Check out this deep dive into emerging HR tools and how top HR pros plan to use them. Plus, there’s a list of Bersin’s top 10 predictions for 2016 at the end. Via Diginomica.com 10 ways to deliver strategic HR If you’re not crystal clear on why HR needs to get more strategic, please read this article in its entirety. If you already get it, then by all means, skip straight to the list of handy tips, many of which you can act on today. I can’t even choose a favorite. Via HR.BLR.com. Generation Z and the Workplace: What You Need to Know Millennials are so passé. Gen Z is where it’s at. And five years down the road, Gen Z’ers will up one-fifth of the workforce. Are they really all that different from Millennials, though? Make sure you know the answer. Via Inc.com. Recruiters Turn to Text Campaigns to Acquire Talent If you’re at all curious about how texting could fit into your recruitment strategy, this article will help you explore the possibilities. It even gets into must-know federal texting regulations. Because of course there are federal texting regulations. Via RecruitingTrends.com. How to win the war for IT talent Even if you’re not an IT recruiter, this article still offers insight that can help you hire the best candidates. And if you are an IT recruiter, you’ll find a bonus video on how to identify rising IT stars. Via CIO.com.", 
        "message": "What do CEOs want? It's not what you think.", 
        "link": "http://bit.ly/1QCK5Bs", 
        "title": "GILD 5-MINUTE MONDAY: What Do CEOs Want from Talent Leaders in 2016?"
    }, 
    {
        "text": "Anyone who watched last year’s Oscar ceremony — or who’s followed the controversy around this year’s nominees — learned an important lesson about diversity: we know when it’s lacking. The awards and protests that followed the ceremony highlighted a problem that many businesses share with the Academy: If you aren’t recruiting a diverse group of candidates, your company’s brand image may suffer the wrath of angry customers. Talent leaders should take that lesson to heart. We live in a diverse society, and people expect to encounter different ethnicities, ages, cultures, physical capabilities, sexual orientations, and genders in the workplace. A company that is noticeably homogenous risks tarnishing its brand image — among other negative consequences . A business that is perceived as discriminatory discourages talented workers from applying and increases employee turnover, which drives up hiring and training costs and negatively impacts productivity. Conversely, diversity attracts talent and encourages innovation. A Forbes Insights survey found that 85 percent of companies with $500 million or more in revenues strongly believed that diversity is critical to having an innovative workplace. Companies competing for specific consumer demographics — Millennials, working mothers, etc. — can tap the insight of their own people within those demographics, noted Mary-Frances Winters, CEO of The Winters Group , a management consulting firm specializing in diversity. These employees are likely to be tuned into the needs, habits, and cultures of those groups and can offer their companies a competitive edge. If that’s not incentive enough, consider the following three statistics from McKinsey : The effects of diversity — and impact of its absence — is clear. But how can talent leaders partner with their HR colleagues to measure their organizations’ levels of diversity? As with every business project, you start with the data. Get demographics for your industry and region . Include data on your target consumer markets as well. Sites like CensusScope , the U.S. Census QuickFacts , and American FactFinder have demographic data for different regions. In addition, professional organizations and trade associations often survey their memberships for demographic data. The Bureau of Labor Statistics also maintains demographic data by industry and job. Rate your diversity by management level. Diversity often declines in upper management, so evaluate your organization’s diversity by job level, not by your total population. Some “diverse” companies may in fact have all-white, all-male management, with most of the organizations’ diversity being relegated to more junior roles. Rate your diversity by industry and profession. For instance, 74 percent of HR managers are female, whereas only 8.8 percent of mechanical engineers are women, according to the Bureau of Labor Statistics . Likewise, 32 percent of software developers are Asian, whereas 34 percent of cooks are Hispanic and Latino. Working to change your industry’s percentages through your recruiting efforts can have a dramatic impact on your company’s bottom line. Once you have a handle on your company’s overall diversity, it’s time to begin applying similar metrics to your hiring efforts. Dr. John Sullivan, recognized HR expert, recently recommended measuring the following in his article on diversity recruiting metrics : There’s another factor to consider when maximizing your recruiting process for diversity: the recruiters themselves. Make sure your team is equipped to source and engage a diverse range of candidates. “You’ve got to have the skills to interact effectively with people of different cultures,” said Simma Lieberman, a consultant who specializes in workplace inclusion and diversity. “I heard a recruiter say they set up a table at a historic black college but nobody stopped to talk to them,” Lieberman said. “Well, it’s the recruiter’s job to engage those people. ” Lieberman also stressed that it’s critical for the interviewers themselves to be diverse. That way, you get a broad perspective and mitigate the potential of losing great candidates due to the biased perception of one or two people. Most organizations say that diversity in hiring is a priority, but few follow through. If you’re only paying lip service to diversity, your employer brand and your bottom line are already suffering. It’s up to talent leaders to drive this change, and the smartest will use data to build and measure the success of their initiatives. Make sure you’re doing that, too. For more data on HR diversity initiatives, download the 2014 survey by the Society for Human Resource Management . var kdosko3fqvlkd3xe,kdosko3fqvlkd3xe_poll=function(){var r=0;return function(n,l){clearInterval(r),r=setInterval(n,l)}}();!function(e,t,n){if(e.getElementById(n)){kdosko3fqvlkd3xe_poll(function(){if(window['om_loaded']){if(!kdosko3fqvlkd3xe){kdosko3fqvlkd3xe=new OptinMonsterApp();return kdosko3fqvlkd3xe.init({u:\"7670.289698\",staging:0,dev:0});}}},25);return;}var d=false,o=e.createElement(t);o.id=n,o.src=\"//a.optnmnstr.com/app/js/api.min.js\",o.onload=o.onreadystatechange=function(){if(!d){if(!this.readyState||this.readyState===\"loaded\"||this.readyState===\"complete\"){try{d=om_loaded=true;kdosko3fqvlkd3xe=new OptinMonsterApp();kdosko3fqvlkd3xe.init({u:\"7670.289698\",staging:0,dev:0});o.onload=o.onreadystatechange=null;}catch(t){}}}};(document.getElementsByTagName(\"head\")[0]||document.documentElement).appendChild(o)}(document,\"script\",\"omapi-script\");", 
        "message": "Diversity affects your bottom line and your employer brand.", 
        "link": "http://bit.ly/1TBcOsF", 
        "title": "Why Data is Key for Diversity Recruiting Initiatives"
    }, 
    {
        "text": "Hiring managers can make or break your recruiting process. When they’re good, your life is good. When they’re bad, every day can be a nightmare. They’ll ignore your emails, bail on interviews, reject your best candidates for silly reasons, and create all sorts of roadblocks for you and your process. Plus, a bad hiring manager can tarnish your professional reputation and maybe even derail your career. Terrible hiring managers seem to be everywhere (that’s why we’ve covered the issue several times: here and here ). But no matter how hard they are to work with, it’s on you to make a great hire. So how can you deal with hiring managers from hell without losing your mind — and maybe your job? Start by taking a step back and asking: “why are they doing this?” There’s a reason your hiring manager is being a pain, and it’s not just to drive you insane. They might not understand the recruiting process, or they may be under extreme pressure from other work obligations. Maybe he or she just lacks confidence in your ability to recruit top candidates. Before you can heal what ails them, you have to diagnose the problem. Carmen Hudson, principal consultant for Recruiting Toolbox , recommends observing your hiring manager’s work. It may help you understand the stress or misunderstanding that’s driving their actions. A common complaint from hiring managers is that recruiters don’t adequately understand the jobs they’re filling. Obviously, recruiters can’t be expected to be experts in every vertical they have to hire for, but that doesn’t mean you can’t get a general understanding of the skills, jargon, and job titles associated with various fields. Otherwise, you can’t expect much respect from your hiring managers. Lou Adler, CEO of staffing firm The Adler Group, stressed that: “Recruiters need to build up trust [with the hiring manager] by speaking the same language.” Consider boning up on some industry lingo and general hiring trends with Gild’s Technical Glossary for IT Jobs , 2015 Hiring Statistics Survey , and The Ultimate Guide to Smart Hiring . An uninformed hiring manager is an anxious hiring manager, so remember to touch base with your hiring managers frequently during the search process. Hudson, for example, meets with a hiring manager at the beginning of the process to go over the recruiting process and clearly define each person’s responsibilities. Later, she has “calibration” meetings to ensure that there are no misunderstandings or unwanted surprises. That’s seriously smart advice, so consider baking those meetings into your existing recruiting process. To maintain a professional relationship — and your sanity — both you and your hiring managers need to commit to goals and deadlines. For instance, “ASAP” isn’t a deadline. You should commit to a specific timeline and follow through. That’s what you want from the hiring manager, right? If it’s a particularly challenging role to fill, explain that it will take longer than normal and set realistic deadlines for you and your team. Use historical data or industry benchmarks to support your cause whenever possible. But don’t stop there. Explain what you expect from your hiring managers, as well. That puts them on notice that ignoring emails or missing interviews isn’t OK. Set some guidelines, like a 24-hour turnaround time on candidate feedback. Firm expectations can save you from losing your best candidate because the hiring manager called her back two days late. All this stuff should roll up into a service level agreement, or SLA. Find out more about why you need one and how to make one here. Hudson also has a three strikes policy. After three failures to meet their commitments, she reserves the right to stop the hiring manager’s search and work on other projects. Writing job descriptions is something all recruiters have to do, but few do it well. There are a variety of reasons why many job descriptions fall flat, but one of the most common culprits is the hiring manager’s inability to articulate the roles and responsibilities of their open req. To solve this, Adler advises recruiters to sit down with the manager and extract as many specific details as possible. He suggests drafting a list of action verbs and asking the hiring manager to fill in the blanks. Verbs like “manage,” “build,” “analyze,” “produce,” “update,” and so forth elicit actual tasks, not passive descriptions like “four years’ experience.” “I want to know what they did during those four years,” he added. Bottom line: If you don’t nail down exact requirements, you’ll be vetting candidates on very vague information and won’t be able to spot great matches. Recruiting may be your job, but the hiring manager has an important role to play, too. Their involvement doesn’t just impact the hiring process — it can impact the overall success of their team and the entire company. Remind them of that, and offer to collaborate and share your experience insight. Hudson suggests using motivational talking points, like “Help me help you” and making it clear that your hiring managers represent the company’s brand to candidates. And when in doubt, don’t forget: a little flattery will take you a long way. As a recruiter, you own the hiring process. That means you’re accountable for the performance of your hiring managers — for better or for worse. Get them on track by setting expectations, establishing accountability, and communicating like crazy. It may take a few months to turn around the hardest cases, but, eventually, smart hiring managers will recognize that working with you will ultimately make them more successful.", 
        "message": "Try these 6 steps to win over even the most hellish hiring manager", 
        "link": "http://bit.ly/1TAEU7U", 
        "title": "6 Ways To Tame the Hiring Manager From Hell"
    }, 
    {
        "text": "What really attracts top talent? Sure, there are the usual perks: salary, availability, and a great 401k, plus a variety of personal reasons, like an easier commute. But when you think about your dream job, you probably think of a company whose product you’ve used. Plus, who doesn’t want to work for a company that their friends and family will immediately recognize? Think about it: Google, Facebook, Microsoft, J.Crew — the list goes on. So why don’t more companies view their own products as a critical recruiting tool? If you don’t already see your company’s product as a key recruiting resource, here are three reasons why you should. It shows candidates what’s in store for them. There’s a ton of information about your company on the Internet: the number of employees you have, the amount of funding you’ve received, and who your leadership is, to name a few. But the most talented candidates know — and want — to look deeper. They want to see and experience what they’ll be working with before they commit. No matter what these candidates’ professions may be, your product is what they’ll be building, marketing, selling, supporting, or even hiring for. It’s a manifestation of your culture. When it comes to practicing what you preach, there are few better examples than Zappos. From their seamless shopping experience to their amazing customer support and surprise delivery upgrades, every touch point with their product provides a glimpse into their corporate culture. In short, your product is a window into your company’s soul. And now that many startups’ cultures are beginning to look alike — free food, happy hours, foosball tables, nap rooms — your product can be a major differentiator in a crowded hiring market. It’s a way to measure candidate engagement. If a candidate cares deeply about the problem your company is solving, they’ll look for ways to find a solution and then improve on it. The most passionate candidates will likely come to the interview with thoughts on how your product can be improved — and this applies to any vertical. So now that you know why your product is a critical recruiting tool, how do you actually use it to attract top talent? Provide multiple avenues to apply. Opportunities for candidates to apply shouldn’t just live on your “Careers” page. Consider including links to job applications on your “Help” and “Support” pages, as well as social outlets like LinkedIn, Twitter, and Facebook. If a candidate is already spending a lot of time interacting with your product, then it makes sense to make the job application a one-click experience whenever possible. Share how your product is built, sold, and supported. By now, most companies are savvy enough to show photos of employees drinking beer, playing games, getting lunch, and working hard in open offices on their “Careers” or “Culture” pages. But why not share how your product is built, sold, supported, and marketed? This is a far more realistic picture of what employees’ daily lives are like. This doesn’t mean you need to share proprietary information like annual revenue or product pricing. It’s simply a smart way to showcase what it’s really like to work on your product and with your team. Offer exercises that are relevant to the work they’ll be doing. Small challenges can be fun and engaging for candidates, and they’re a great way to gauge an applicant’s aptitude for a given role. For example, if it’s a marketing role, ask the candidate to design a sample campaign. If it’s sales, have them present a demo of the product. If it’s for a design position, have them rethink the design experience. If it’s an engineering role, ask them to take up a coding challenge similar to what your team is working on. Sometimes, however, candidates may not have direct access to your product, especially if it’s something like an enterprise SaaS platform. In those situations, your best bet is to find parallels in the consumer space that match the experience your product provides. There are plenty of ways to find challenges that will help you evaluate a candidate’s talent and knowledge in a relevant way. At a time when recruiters should be using every asset at their disposal, there’s no excuse for ignoring your product’s recruiting potential. It’s a great way to showcase your company’s value, its culture, and its priorities. And unlike expensive job postings or exorbitant recruiting agency fees, it won’t cost you a dime — and that makes it a recruiting tool that every CEO can get behind.", 
        "message": "Why don't more companies view their own products as a critical #recruiting tool?", 
        "link": "http://bit.ly/1o35P03", 
        "title": "Why Your Company’s Product is Your Most Underrated Recruiting Asset"
    }, 
    {
        "text": "For talent managers, real success lies not in filling the positions that are open today, but in accurately predicting the positions that will need to be filled in the future. As it also turns out, the most successful talent leaders are those who take steps now to ensure that their organization stays ahead of the curve when it comes to attracting talent for future positions. There’s no shortage of information available these days, so access to information is really not an issue. What is an issue, though, is wading through the ever-growing volumes of information available in various formats — online, print, audio, and video. Here are some strategies you should implement now to ensure that your organization comes out on top in the future. Participation in relevant trade organizations should be your first step in ensuring that you’re ahead of trends that impact both your profession and your industry. Some key trade organizations that serve the talent management industry are the Human Capital Institute , SHRM , and the Talent Management Alliance , but you should also participate in industry-related groups. For instance, if you’re in the credit union industry, CUNA and CUES are two top trade organizations — but there are scores of conferences for virtually every industry. Plus, groups like these publish ample information on their websites, conduct research, and hold a variety of conferences and trade shows. Nearly 80 years ago, Napoleon Hill introduced the concept of MasterMinds in his book Think and Grow Rich . While the group isn’t as well known as some peer-to-peer mentoring communities, MasterMinds is highly regarded among many professionals. Through regular group meetings, specific challenges and problems are tackled in team settings, which can help individuals navigate their own professional hurdles. MasterMinds Meetups is a good starting point for finding a group in your area. Joining — and regularly participating in — LinkedIn Groups is a great way to access other talent management professionals, maintain relevance in your industry, and stay on top of industry trends. Some of the largest HR professional groups by number of participants (which isn’t necessarily a barometer of relevance) are: Human Resources (HR) & Talent Management Executive , SHRM (Society for Human Resource Management) , and Talent Management Research and Best Practices Network . With millions of users and thousands of groups, LinkedIn is a useful tool for connecting with businesses in your area and joining discussion forums that tackle top issues in all industries. For talent leaders and recruiters, Twitter is all about the power of information. For instance, teachers are turning to Twitter in droves to share advice and ideas and seek solutions to common challenges. There are a multitude of communities on Twitter for teachers, from the purely social, to more educational, like #edchat. Can talent professionals gain trending traction via Twitter? Absolutely! @FistfulOfTalent is just one Twitter account that is frequented by talent professionals (more than 40,000 of them to be exact). For more specific needs, consider following hashtags like #talentmanagement, #thwnews, #hrtechworld and #hrtech. While it can take some time to find sources that are the most relevant and reputable, the resulting real-time information is definitely worth the effort. This free tool from Google lets you enter keywords and phrases you’re interested in tracking and select how often — and from which sources — you’d like to receive email updates. It’s a great way to stay on top of changes and trends in your industry or in recruiting in general. In short, don’t wait for someone else to tell you what’s going on. Be the person that everyone else goes to for insightful information. Technorati is a great site that can help you find blogs on a wide range of topics, and there certainly are a lot out there. But we’d be remiss if we didn’t list our own blog as one to watch, but there are plenty of others you may want to bookmark: Additionally, Harvard Business Review has a number of blogs relevant to talent managers including “ Leadership Development ,” “ Human Resource Management “, and “ Organizational Culture .” There are a number of not-entirely-focused-on-talent-management options too, which brings us to our next recommendation… In our increasingly connected world, it’s wise to gain an understanding of how other industries work — especially if you can see how these trends affect your own industry. Some of the best ideas and insights come from seemingly unrelated bits of information. As Donatella Versace famously said: “Creativity comes from a conflict of ideas.” In other words, don’t focus solely on talent management and industry-related sources. Cast a wide net. You never know where that next great idea spark will come from.", 
        "message": "Struggling to stay current on key #recruitingtrends? 7 tips to keep you caught up on all things talent", 
        "link": "http://bit.ly/1Tqb06c", 
        "title": "7 Ways to Stay on Top of Recruiting Trends In Your Industry"
    }, 
    {
        "text": "Most candidates are courteous, prepared, and professional. But the ones who aren’t often make recruiters want to shut the door, turn off the lights, and swallow a Xanax. But recruiters aren’t the only ones who have to deal with job applicants from hell. Hiring managers get their fair share of losers, whackos, and jerks, too. We caught up with a few hiring managers from around the country to figure out which candidates bugged them the most — and we weren’t remotely prepared for all the horror stories we heard. You’ve been warned. “Every other phone interview, I get, ‘What is this company again?'” said Ali Mercier. Mercier is a hiring manager for The Leadership Program , a company that fosters youth and professional development. It drives her nuts that candidates don’t bother to learn about her company, even though information is readily available on its website and through social media. Henry Goldbeck, president of Goldbeck Recruiting in Vancouver, Canada, hears the same refrain from the hiring managers he works with. “Research is so easy to do with the Internet that the lack of it is astounding,” he said. In the past, candidates had to trek to the library and dig up newspaper or magazine coverage. But now, that info is available literally anywhere, any time. “But so many don’t do it, even when we tell them to,” Goldbeck said. And when candidates actually do their homework, they can still blow it. Sarah Pike, a manager at CableTV.com , recalls a candidate who had clearly studied interviewers’ LinkedIn profiles. Unfortunately, the applicant mentioned personal information during the interview, like: “I know you speak Spanish,” Pike said. “It came across as oddly creepy.” Click To Tweet Like many companies, The Leadership Program has a casual vibe — but that doesn’t mean candidates should show up for an interview in jeans and a t-shirt. Yet according to Mercier, some do. Hiring managers also tell Goldbeck about unshaven, sloppy-looking candidates. “You should be spiffed up and err on the side of being overdressed, even if employees work in khakis and a Polo shirt,” he said. Countless websites offering career advice echo his words, but somehow, some candidates still haven’t gotten the message. And then there are candidates who bring too much of their personal lives to the job — though the most egregious offenders usually don’t make it to a hiring manager. Once, when a candidate was interviewing with Goldbeck, a woman with a baby stormed into the interview room, handed the candidate the baby, and walked out. No explanation was offered. Another candidate sent Goldbeck a photo of himself and his wife at their wedding reception. “Obviously totally drunk,” he said. A candidate for a sales position sent a photo of his wife in a bikini along with his resume. To no one’s surprise, the last two candidates failed to advance. Goldbeck doesn’t remember what happened to the candidate with the baby, but said he didn’t hold the incident against him. Other bad behavior is more subtle, but it doesn’t go unnoticed by hiring managers. A candidate who arrived late for an in-person interview complained to Pike that the company had given him bad directions. “Placing the blame on us was not a great move,” she said. Sometimes, poor candidate behavior isn’t directed at the recruiter or the hiring manager. “We’ve seen rudeness towards people at the reception desk, people on the phone, people in the office. If you’re mean or dismissive to the receptionist, that says something to me,” Mercier said. Though the vast majority of candidates are honest, the few who aren’t really make managers and recruiters see red. Goldbeck and others have heard candidates express enthusiasm about a job to the recruiter, only to tell the hiring manager they’re not interested. “There’s this wild, irrational hope that they can fake their way into an interview and get a different position,” Goldbeck said. That doesn’t endear them to hiring managers or recruiters, who need to fill the open job on a deadline and book interviews around their tight schedules. Even more maddening to hiring managers — and embarrassing to recruiters — are candidates who lie about their current employment. These candidates can slip through and may even make their way to the offer stage before references are checked. But once references are checked, recruiters and hiring managers always find out. By then, these unscrupulous folks have managed to waste everyone’s time and resources. Recruiters often think that they’re the only ones who have to deal with nightmare candidates. But even slovenly, unprepared, and unscrupulous applicants can pass a phone screen and make their way to a hiring manager. This isn’t just a minor annoyance. It slows down the hiring process, wastes time and resources, and makes recruiters look bad for not booting these folks out of the process sooner. There’s no foolproof way to catch them, but perhaps smarter, profile-based recruiting technologies can help. A few curveball questions in the initial interview probably wouldn’t hurt, either.", 
        "message": "Horror stories from hiring managers: the candidate behaviors that drive us all nuts", 
        "link": "http://bit.ly/1QpTAHj", 
        "title": "3 Types of Candidates Every Hiring Manager Hates"
    }, 
    {
        "text": "Welcome back, friends. We’ve got a great line up to help you kick off your week. Check out the this week’s top hiring headlines. Top Candidates Are Gone Within 10 Days … So Assign Each A ‘Hire-By-Date’ You guys. This one is the real deal. Dr. John Sullivan makes a persuasive case for accelerating your hiring process and using deadlines to keep your team honest. Read it now and thank me later. In a hurry? Just read the first two sections. You’ll inevitably decide it’s worth the full read in the end. Via EREmedia.com How OKCupid Changed Hiring Forever What do online dating and recruiting have in common? What don’t they have in common? They share the same benefits and challenges. One of those challenges is how overwhelming the number of responses can be. Our very own Robert Carroll discusses hows OKCupid offered something new and groundbreaking — and how recruiters should use, too. Via RecruitingDaily.com The First Four Things You Should Do Every Workday If you make the most of your mornings, you set yourself up for a productive day. That leads to a productive week, then month, then year. Before you know it, you’re VP of Talent. Seriously, it can happen. It’s not too late to start today with these A.M. tips. Via FastCompany.com What Do These 5 Very Different Companies Have in Common? Remote Jobs Offering remote positions would ultimately help our efforts, right? We’d cast a wider net, and we’d be able to offer a massive perk to attract the best people. Fight the perception that only certain industries can offer remote jobs. Check out five companies that represent several industries, yet all offer remote positions. Via Business2Community.com The 5 Levels Of Social Media Recruitment Maturity What level is your team on, and how do you advance? Social media can be a great source for quality candidates, if you’re doing it right — so make sure you’re doing it right. There’s even a handy action plan at the bottom. Via EREmedia.com. How To Fall In Love With Your Job Again We all get a bit burned out now and then, but that doesn’t mean you should give up a great job, especially a job where you get to help others find their next great career move. Follow even a couple of these six steps, and you’ll be back to the honeymoon stage. Via FastCompany.com.", 
        "message": "Why you keep losing out on top talent, plus the rest of this week's top hiring headlines. ", 
        "link": "http://bit.ly/1RiSF8S", 
        "title": "GILD 5-MINUTE MONDAY: Why You Keep Losing Out on Top Talent"
    }, 
    {
        "text": "Spoiled. Lazy. Entitled. Always face-down in some digital device. The Millennial generation has been criticized for years, routinely beaten up for some perceived failing or another. These criticisms almost always come from Baby Boomers or Gen-Xers. They’re also almost always wrong. A PriceWaterhouseCoopers report entitled “ Millennials in the Workplace ” notes that these up-and-comers, roughly described as those born between 1980 and 2000, already make up 25 percent of the U.S. workforce. That number will jump to 50 percent by 2020. As Millennials continue to flood the talent market, being able to attract and retain these young professionals is key for employers. To do that successfully, you’ll have to forget everything you’ve learned about Millennials to date. One of the most common criticisms leveled at Millennials is that they’re overly dependent on technology. But they’re not dependent — they just view technology differently. Growing up in the digital age, Millennials have a relationship with technology that can easily be misconstrued by other generations. In the PWC report, more than 40 percent of Millennials surveyed said they feel their use of technology was “not always understood,” especially in the workplace. For instance, 41 percent of Millennials said they’d rather communicate digitally than have a face-to-face or phone conversation. This kind of communication style isn’t always understood by employers. But this preference for digital communication isn’t necessarily a factor of comfort or fear of personal contact. The demands of the contemporary workplace means they’re constantly multitasking in order to stay on top of an overflowing inbox. They know that an email or a message sent over Gchat or Slack is a much faster, more efficient use of time than an in-person conversation. In short, it’s not that they don’t want to talk to you — they just don’t have the time. Consequently, when employers refuse to understand their young employees’ close ties with technology, they may find their talent looking elsewhere for a workplace more aligned with their own digitally-driven lifestyle. One of the most misunderstood things about Millennial professionals is their attitude toward employer loyalty. Since they entered the workforce, Millennials have weathered a rough economy and witnessed massive layoffs that wiped out loyal, competent, and hard-working employees. So, it makes sense that Millennials aren’t planning on devoting their loyalty to one employer for the rest of their lives. Unlike previous generations, they know they can’t count on a gold watch upon retirement. Instead, they understand that employment is a transaction: my time and skills in exchange for your compensation. They know that once they’re no longer useful, they’ll be cut loose. In its report, PricewaterhouseCoopers found that just over half of those surveyed say they expect to have between two and five employers in their lifetime. More than a quarter surveyed expect to have more than six employers. This doesn’t mean Millennials want to be job hoppers. It just means that their expectations of work are different than their more seasoned colleagues. This attitude can present a challenge for today’s talent management professionals. It takes engagement and investment to gain the loyalty of Millennials. To retain young talent, management needs to rethink progression in their organization. More than half of Millennials surveyed say they want development and career advancement from their employers, in addition to competitive wages. In fact, the opportunity for career progression was rated the most attractive feature an employer can offer, trumping even a competitive salary. Millennials may have made concessions in a tight job market, but as the economy rebounds, the gloves are off. To keep them from moving on to a job with better pay or better prospects for advancement requires a new normal of continuous training, learning, and career growth. Social purpose plays a big part in Millennials’ consumer activity and their choice of employers. They want to do good in the world through what they buy and where they work. The Millennial Impact Project , sponsored by the Case Foundation, a social investment organization, found that Millennials are remarkable givers. The Project reports that 84 percent of Millennials surveyed made charitable donations, and 70 percent of them spent at least an hour volunteering in 2014. This is in contrast to the notion that Millennials are self-absorbed or lazy. It also means that they have different expectations of the brands they buy from and the employers they work for. Employers who get this include Chipotle , Panera Bread , and Patagonia . They attract both consumers and workers through thoughtful branding of corporate responsibility. Their work cultures support social good, and they often match their employees’ charitable donations to causes or issues that they’re passionate about. If you think of Millennials as entitled, self-absorbed job-hoppers, you’d better think again. Millennials are rapidly swelling the ranks at companies of all sizes, and understanding them creates a sharp, competitive advantage in recruiting and business success. If you don’t take the time to understand them, your competition will.", 
        "message": "What you know about #Millennials is wrong. Learn how to #hire and retain them effectively", 
        "link": "http://bit.ly/1L3GmhF", 
        "title": "Everything Recruiters Know About Millennials is Wrong"
    }
]